RT-Thread/rt-thread/bsp/NuTiny-EVB-NUC472/Libraries/StdDriver/src/emac.c
/**************************************************************************//**
 * @file     emac.c
 * @version  V1.00
 * $Revision: 17 $
 * $Date: 15/11/19 6:57p $
 * @brief    NUC472/NUC442 EMAC driver source file
 *
 * @note
 * Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NUC472_442.h"

/** @addtogroup NUC472_442_Device_Driver NUC472/NUC442 Device Driver
  @{
*/

/** @addtogroup NUC472_442_EMAC_Driver EMAC Driver
  @{
*/


// Below are structure, definitions, static variables used locally by EMAC driver and does not want to parse by doxygen unless HIDDEN_SYMBOLS is defined
/// @cond HIDDEN_SYMBOLS

/** @addtogroup NUC472_442_EMAC_EXPORTED_CONSTANTS EMAC Exported Constants
  @{
*/
// Un-comment to print EMAC debug message
#define EMAC_DBG
#ifndef EMAC_DBG
#define printf(...)
#endif

// PHY Register Description
#define PHY_CNTL_REG    0x00        ///< PHY control register address
#define PHY_STATUS_REG  0x01        ///< PHY status register address
#define PHY_ID1_REG     0x02        ///< PHY ID1 register
#define PHY_ID2_REG     0x03        ///< PHY ID2 register
#define PHY_ANA_REG     0x04        ///< PHY auto-negotiation advertisement register
#define PHY_ANLPA_REG   0x05        ///< PHY auto-negotiation link partner availability register
#define PHY_ANE_REG     0x06        ///< PHY auto-negotiation expansion register

//PHY Control Register
#define PHY_CNTL_RESET_PHY      (1 << 15)
#define PHY_CNTL_DR_100MB       (1 << 13)
#define PHY_CNTL_ENABLE_AN      (1 << 12)
#define PHY_CNTL_POWER_DOWN     (1 << 11)
#define PHY_CNTL_RESTART_AN     (1 << 9)
#define PHY_CNTL_FULLDUPLEX     (1 << 8)

// PHY Status Register
#define PHY_STATUS_AN_COMPLETE   (1 << 5)
#define PHY_STATUS_LINK_VALID    (1 << 2)

// PHY Auto-negotiation Advertisement Register
#define PHY_ANA_DR100_TX_FULL   (1 << 8)
#define PHY_ANA_DR100_TX_HALF   (1 << 7)
#define PHY_ANA_DR10_TX_FULL    (1 << 6)
#define PHY_ANA_DR10_TX_HALF    (1 << 5)
#define PHY_ANA_IEEE_802_3_CSMA_CD   (1 << 0)

// PHY Auto-negotiation Link Partner Advertisement Register
#define PHY_ANLPA_DR100_TX_FULL   (1 << 8)
#define PHY_ANLPA_DR100_TX_HALF   (1 << 7)
#define PHY_ANLPA_DR10_TX_FULL    (1 << 6)
#define PHY_ANLPA_DR10_TX_HALF    (1 << 5)

// EMAC Tx/Rx descriptor's owner bit
#define EMAC_DESC_OWN_EMAC 0x80000000  ///< Set owner to EMAC
#define EMAC_DESC_OWN_CPU  0x00000000  ///< Set owner to CPU

// Rx Frame Descriptor Status
#define EMAC_RXFD_RTSAS   0x0080  ///< Time Stamp Available
#define EMAC_RXFD_RP      0x0040  ///< Runt Packet
#define EMAC_RXFD_ALIE    0x0020  ///< Alignment Error
#define EMAC_RXFD_RXGD    0x0010  ///< Receiving Good packet received
#define EMAC_RXFD_PTLE    0x0008  ///< Packet Too Long Error
#define EMAC_RXFD_CRCE    0x0002  ///< CRC Error
#define EMAC_RXFD_RXINTR  0x0001  ///< Interrupt on receive

// Tx Frame Descriptor's Control bits
#define EMAC_TXFD_TTSEN     0x08      ///< Tx time stamp enable
#define EMAC_TXFD_INTEN     0x04      ///< Tx interrupt enable
#define EMAC_TXFD_CRCAPP    0x02      ///< Append CRC
#define EMAC_TXFD_PADEN     0x01      ///< Padding mode enable

// Tx Frame Descriptor Status
#define EMAC_TXFD_TXINTR 0x0001  ///< Interrupt on Transmit
#define EMAC_TXFD_DEF    0x0002  ///< Transmit deferred 
#define EMAC_TXFD_TXCP   0x0008  ///< Transmission Completion 
#define EMAC_TXFD_EXDEF  0x0010  ///< Exceed Deferral
#define EMAC_TXFD_NCS    0x0020  ///< No Carrier Sense Error
#define EMAC_TXFD_TXABT  0x0040  ///< Transmission Abort 
#define EMAC_TXFD_LC     0x0080  ///< Late Collision 
#define EMAC_TXFD_TXHA   0x0100  ///< Transmission halted
#define EMAC_TXFD_PAU    0x0200  ///< Paused
#define EMAC_TXFD_SQE    0x0400  ///< SQE error 
#define EMAC_TXFD_TTSAS  0x0800  ///< Time Stamp available

/*@}*/ /* end of group NUC472_442_EMAC_EXPORTED_CONSTANTS */

/** @addtogroup NUC472_442_EMAC_EXPORTED_TYPEDEF EMAC Exported Type Defines
  @{
*/

/** Tx/Rx buffer descriptor structure */
typedef struct {
    uint32_t u32Status1;   ///< Status word 1
    uint32_t u32Data;      ///< Pointer to data buffer
    uint32_t u32Status2;   ///< Status word 2
    uint32_t u32Next;      ///< Pointer to next descriptor
    uint32_t u32Backup1;   ///< For backup descriptor fields over written by time stamp
    uint32_t u32Backup2;   ///< For backup descriptor fields over written by time stamp
} EMAC_DESCRIPTOR_T;

/** Tx/Rx buffer structure */
typedef struct {
    uint8_t au8Buf[1520];
} EMAC_FRAME_T;

/*@}*/ /* end of group NUC472_442_EMAC_EXPORTED_TYPEDEF */

// local variables
static volatile EMAC_DESCRIPTOR_T rx_desc[EMAC_RX_DESC_SIZE];
static volatile EMAC_FRAME_T rx_buf[EMAC_RX_DESC_SIZE];
static volatile EMAC_DESCRIPTOR_T tx_desc[EMAC_TX_DESC_SIZE];
static volatile EMAC_FRAME_T tx_buf[EMAC_TX_DESC_SIZE];


static uint32_t u32CurrentTxDesc, u32NextTxDesc, u32CurrentRxDesc;
static uint32_t s_u32EnableTs = 0;

/** @addtogroup NUC472_442_EMAC_EXPORTED_FUNCTIONS EMAC Exported Functions
  @{
*/

/**
  * @brief  Trigger EMAC Rx function
  * @param  None
  * @return None
  */
#define EMAC_TRIGGER_RX() do{EMAC->RXST = 0;}while(0)

/**
  * @brief  Trigger EMAC Tx function
  * @param  None
  * @return None
  */
#define EMAC_TRIGGER_TX() do{EMAC->TXST = 0;}while(0)

/**
  * @brief  Write PHY register
  * @param[in]  u32Reg PHY register number
  * @param[in]  u32Addr PHY address, this address is board dependent
  * @param[in] u32Data data to write to PHY register
  * @return None
  */
static void EMAC_MdioWrite(uint32_t u32Reg, uint32_t u32Addr, uint32_t u32Data)
{
    // Set data register
    EMAC->MIIMDAT = u32Data ;
    // Set PHY address, PHY register address, busy bit and write bit
    EMAC->MIIMCTL = u32Reg | (u32Addr << 8) | EMAC_MIIMCTL_BUSY_Msk | EMAC_MIIMCTL_WRITE_Msk | EMAC_MIIMCTL_MDCON_Msk;
    // Wait write complete by polling busy bit.
    while(EMAC->MIIMCTL & EMAC_MIIMCTL_BUSY_Msk);

