RT-Thread/rt-thread/bsp/NuTiny-EVB-NUC472/Libraries/StdDriver/src/emac.c
    EMAC_PhyInit();
}

/**
  * @brief  This function stop all receive and transmit activity and disable MAC interface
  * @param None
  * @return None
  */

void EMAC_Close(void)
{
    EMAC->CTL |= EMAC_CTL_RST_Msk;
}

/**
  * @brief  Set the device MAC address
  * @param[in]  pu8MacAddr  Pointer to uint8_t array holds MAC address
  * @return None
  */
void EMAC_SetMacAddr(uint8_t *pu8MacAddr)
{
    EMAC_EnableCamEntry(0, pu8MacAddr);

}

/**
  * @brief Fill a CAM entry for MAC address comparison.
  * @param[in] u32Entry MAC entry to fill. Entry 0 is used to store device MAC address, do not overwrite the setting in it.
  * @param[in] pu8MacAddr  Pointer to uint8_t array holds MAC address
  * @return None
  */
void EMAC_EnableCamEntry(uint32_t u32Entry, uint8_t *pu8MacAddr)
{
    uint32_t u32Lsw, u32Msw;

    u32Lsw = (pu8MacAddr[4] << 24) |
             (pu8MacAddr[5] << 16);
    u32Msw = (pu8MacAddr[0] << 24)|
             (pu8MacAddr[1] << 16)|
             (pu8MacAddr[2] << 8)|
             pu8MacAddr[3];

    *(uint32_t volatile *)(&EMAC->CAM0M + u32Entry * 2) = u32Msw;
    *(uint32_t volatile *)(&EMAC->CAM0L + u32Entry * 2) = u32Lsw;

    EMAC->CAMEN |= (1 << u32Entry);
}

/**
  * @brief  Disable a specified CAM entry
  * @param[in]  u32Entry CAM entry to be disabled
  * @return None
  */
void EMAC_DisableCamEntry(uint32_t u32Entry)
{
    EMAC->CAMEN &= ~(1 << u32Entry);
}

// Receive functions
/**
  * @brief Receive an Ethernet packet
  * @param[in] pu8Data Pointer to a buffer to store received packet (4 byte CRC removed)
  * @param[in] pu32Size Received packet size (without 4 byte CRC).
  * @return Packet receive success or not
  * @retval 0 No packet available for receive
  * @retval 1 A packet is received
  * @note Return 0 doesn't guarantee the packet will be sent and received successfully.
  */
uint32_t EMAC_RecvPkt(uint8_t *pu8Data, uint32_t *pu32Size)
{
    EMAC_DESCRIPTOR_T *desc;
    uint32_t status, reg;
    uint32_t u32Count = 0;

    // Clear Rx interrupt flags
    reg = EMAC->INTSTS;
    EMAC->INTSTS = reg & 0xFFFF;  // Clear all RX related interrupt status

    if (reg & EMAC_INTSTS_RXBEIF_Msk) {
        // Bus error occurred, this is usually a bad sign about software bug and will occur again...
        printf("RX bus error\n");
    } else {

        // Get Rx Frame Descriptor
        desc = (EMAC_DESCRIPTOR_T *)u32CurrentRxDesc;

        // If we reach last recv Rx descriptor, leave the loop
        //if(EMAC->CRXDSA == (uint32_t)desc)
        //    return(0);
        if ((desc->u32Status1 & EMAC_DESC_OWN_EMAC) != EMAC_DESC_OWN_EMAC) { // ownership=CPU

            status = desc->u32Status1 >> 16;

            // If Rx frame is good, process received frame
            if(status & EMAC_RXFD_RXGD) {
                // lower 16 bit in descriptor status1 stores the Rx packet length
                *pu32Size = desc->u32Status1 & 0xffff;
                memcpy(pu8Data, (uint8_t *)desc->u32Backup1, *pu32Size);
                u32Count = 1;
            } else {
                // Save Error status if necessary
                if (status & EMAC_RXFD_RP);
                if (status & EMAC_RXFD_ALIE);
                if (status & EMAC_RXFD_PTLE);
                if (status & EMAC_RXFD_CRCE);
            }
        }
    }
    return(u32Count);
}

/**
  * @brief Receive an Ethernet packet and the time stamp while it's received
  * @param[out] pu8Data Pointer to a buffer to store received packet (4 byte CRC removed)
  * @param[out] pu32Size Received packet size (without 4 byte CRC).
  * @param[out] pu32Sec Second value while packet sent
  * @param[out] pu32Nsec Nano second value while packet sent
  * @return Packet receive success or not
  * @retval 0 No packet available for receive
  * @retval 1 A packet is received
  * @note Return 0 doesn't guarantee the packet will be sent and received successfully.
  * @note Largest Ethernet packet is 1514 bytes after stripped CRC, application must give
  *       a buffer large enough to store such packet
  */
uint32_t EMAC_RecvPktTS(uint8_t *pu8Data, uint32_t *pu32Size, uint32_t *pu32Sec, uint32_t *pu32Nsec)
{
    EMAC_DESCRIPTOR_T *desc;
    uint32_t status, reg;
    uint32_t u32Count = 0;

    // Clear Rx interrupt flags
    reg = EMAC->INTSTS;
    EMAC->INTSTS = reg & 0xFFFF; // Clear all Rx related interrupt status

    if (reg & EMAC_INTSTS_RXBEIF_Msk) {
        // Bus error occurred, this is usually a bad sign about software bug and will occur again...
        printf("RX bus error\n");
    } else {

        // Get Rx Frame Descriptor
        desc = (EMAC_DESCRIPTOR_T *)u32CurrentRxDesc;

        // If we reach last recv Rx descriptor, leave the loop
        if(EMAC->CRXDSA == (uint32_t)desc)
            return(0);
        if ((desc->u32Status1 | EMAC_DESC_OWN_EMAC) != EMAC_DESC_OWN_EMAC) { // ownership=CPU

            status = desc->u32Status1 >> 16;

            // If Rx frame is good, process received frame
            if(status & EMAC_RXFD_RXGD) {
                // lower 16 bit in descriptor status1 stores the Rx packet length
                *pu32Size = desc->u32Status1 & 0xffff;
                memcpy(pu8Data, (uint8_t *)desc->u32Backup1, *pu32Size);

                *pu32Sec = desc->u32Next; // second stores in descriptor's NEXT field
                *pu32Nsec = EMAC_Subsec2Nsec(desc->u32Data); // Sub nano second store in DATA field

                u32Count = 1;
            } else {
                // Save Error status if necessary
                if (status & EMAC_RXFD_RP);
                if (status & EMAC_RXFD_ALIE);
                if (status & EMAC_RXFD_PTLE);
                if (status & EMAC_RXFD_CRCE);
            }
        }
    }
    return(u32Count);
}

/**
  * @brief Clean up process after a packet is received
  * @param None
  * @return None
  * @details EMAC Rx interrupt service routine \b must call this API to release the resource use by receive process
  * @note Application can only call this function once every time \ref EMAC_RecvPkt or \ref EMAC_RecvPktTS returns 1
  */
void EMAC_RecvPktDone(void)
{
    EMAC_DESCRIPTOR_T *desc;
    // Get Rx Frame Descriptor
    desc = (EMAC_DESCRIPTOR_T *)u32CurrentRxDesc;

    // restore descriptor link list and data pointer they will be overwrite if time stamp enabled
    desc->u32Data = desc->u32Backup1;
    desc->u32Next = desc->u32Backup2;

    // Change ownership to DMA for next use
    desc->u32Status1 |= EMAC_DESC_OWN_EMAC;

